<a href="https://colab.research.google.com/github/MUG594/VIS-Project/blob/main/VIS_Team_Project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Team project in VIS: **Fertility-Rate**
Team project by Mariella Galneder and Fabian Mugrauer.

In [122]:
import numpy as np
import pandas as pd

In [123]:
childsPerWomanOriginal = pd.read_csv('https://raw.githubusercontent.com/MUG594/VIS-Project/main/SourceSheets/children-born-per-woman.csv')
childsPerWomanOriginal = childsPerWomanOriginal.rename(columns = {'Fertility rate (Select Gapminder, v12) (2017)': 'Fertility_Rate' }, inplace = False)
childsPerWomanOriginal

            Entity Code  Year  Fertility_Rate
0      Afghanistan  AFG  1950            7.57
1      Afghanistan  AFG  1951            7.56
2      Afghanistan  AFG  1952            7.55
3      Afghanistan  AFG  1953            7.54
4      Afghanistan  AFG  1954            7.53
...            ...  ...   ...             ...
21577     Zimbabwe  ZWE  2015            3.84
21578     Zimbabwe  ZWE  2016            3.76
21579     Zimbabwe  ZWE  2017            3.68
21580     Zimbabwe  ZWE  2018            3.61
21581     Zimbabwe  ZWE  2019            3.53

[21582 rows x 4 columns]

In [124]:
continentsCountry = pd.read_csv("https://raw.githubusercontent.com/MUG594/VIS-Project/main/SourceSheets/continents-country.csv")
continentsCountry = continentsCountry.drop(columns=["Entity", "Year"])
continentsCountry

         Code Continent
0    OWID_ABK      Asia
1         AFG      Asia
2    OWID_AKD      Asia
3         ALB    Europe
4         DZA    Africa
..        ...       ...
280  OWID_YGS    Europe
281       ZMB    Africa
282  OWID_ZAN    Africa
283       ZWE    Africa
284       ALA    Europe

[285 rows x 2 columns]

In [125]:
countriesGdp = pd.read_csv("https://raw.githubusercontent.com/MUG594/VIS-Project/main/SourceSheets/gdp-capita.csv")
countriesGdp = countriesGdp.drop(columns=["Entity", "145446-annotations"])
countriesGdp = countriesGdp.rename(columns = {'GDP per capita': 'GDP' }, inplace = False)
countriesGdp

      Code  Year      GDP
0      AFG  1950  1156.00
1      AFG  1951  1170.00
2      AFG  1952  1189.00
3      AFG  1953  1240.00
4      AFG  1954  1245.00
...    ...   ...      ...
19873  ZWE  2014  1594.00
19874  ZWE  2015  1560.00
19875  ZWE  2016  1534.00
19876  ZWE  2017  1582.37
19877  ZWE  2018  1611.41

[19878 rows x 3 columns]

In [126]:
countriesReligion = pd.read_csv("https://raw.githubusercontent.com/MUG594/VIS-Project/main/SourceSheets/country-religion.csv")
countriesReligion = countriesReligion.drop(columns=["Entity", "Year"])
countriesReligion = countriesReligion.rename(columns = {'Main religion ': 'Religion' }, inplace = False)
countriesReligion

         Code      Religion
0         AFG         Islam
1         ALB         Islam
2         DZA         Islam
3         ASM  Christianity
4         AND  Christianity
..        ...           ...
236       ESH         Islam
237  OWID_WRL  Christianity
238       YEM         Islam
239       ZMB  Christianity
240       ZWE  Christianity

[241 rows x 2 columns]

In [127]:
countriesSexRatio = pd.read_csv("https://raw.githubusercontent.com/MUG594/VIS-Project/main/SourceSheets/sex-ratio.csv")
countriesSexRatio = countriesSexRatio.drop(columns=["Entity"])
countriesSexRatio = countriesSexRatio.rename(columns = {'Sex ratio at birth (Chao et al. 2019)': 'Sex_Ratio' }, inplace = False)
countriesSexRatio

      Code  Year   Sex_Ratio
0      AFG  1950  105.188944
1      AFG  1951  105.193156
2      AFG  1952  105.184021
3      AFG  1953  105.181066
4      AFG  1954  105.192903
...    ...   ...         ...
14411  ZWE  2013  102.153432
14412  ZWE  2014  102.187415
14413  ZWE  2015  102.232564
14414  ZWE  2016  102.284384
14415  ZWE  2017  102.333534

[14416 rows x 3 columns]

# Merge

In [128]:
resultSet = pd.merge(childsPerWomanOriginal, continentsCountry,"left",left_on="Code", right_on="Code" )
resultSet

            Entity Code  Year  Fertility_Rate Continent
0      Afghanistan  AFG  1950            7.57      Asia
1      Afghanistan  AFG  1951            7.56      Asia
2      Afghanistan  AFG  1952            7.55      Asia
3      Afghanistan  AFG  1953            7.54      Asia
4      Afghanistan  AFG  1954            7.53      Asia
...            ...  ...   ...             ...       ...
21577     Zimbabwe  ZWE  2015            3.84    Africa
21578     Zimbabwe  ZWE  2016            3.76    Africa
21579     Zimbabwe  ZWE  2017            3.68    Africa
21580     Zimbabwe  ZWE  2018            3.61    Africa
21581     Zimbabwe  ZWE  2019            3.53    Africa

[21582 rows x 5 columns]

In [129]:
resultSet = pd.merge(resultSet, countriesGdp,"left",left_on=["Code", "Year"], right_on=["Code", "Year"] )
resultSet

            Entity Code  Year  Fertility_Rate Continent      GDP
0      Afghanistan  AFG  1950            7.57      Asia  1156.00
1      Afghanistan  AFG  1951            7.56      Asia  1170.00
2      Afghanistan  AFG  1952            7.55      Asia  1189.00
3      Afghanistan  AFG  1953            7.54      Asia  1240.00
4      Afghanistan  AFG  1954            7.53      Asia  1245.00
...            ...  ...   ...             ...       ...      ...
22094     Zimbabwe  ZWE  2015            3.84    Africa  1560.00
22095     Zimbabwe  ZWE  2016            3.76    Africa  1534.00
22096     Zimbabwe  ZWE  2017            3.68    Africa  1582.37
22097     Zimbabwe  ZWE  2018            3.61    Africa  1611.41
22098     Zimbabwe  ZWE  2019            3.53    Africa      NaN

[22099 rows x 6 columns]

In [130]:
resultSet = pd.merge(resultSet, countriesReligion,"left",left_on="Code", right_on="Code" )
resultSet

            Entity Code  Year  Fertility_Rate Continent      GDP      Religion
0      Afghanistan  AFG  1950            7.57      Asia  1156.00         Islam
1      Afghanistan  AFG  1951            7.56      Asia  1170.00         Islam
2      Afghanistan  AFG  1952            7.55      Asia  1189.00         Islam
3      Afghanistan  AFG  1953            7.54      Asia  1240.00         Islam
4      Afghanistan  AFG  1954            7.53      Asia  1245.00         Islam
...            ...  ...   ...             ...       ...      ...           ...
26119     Zimbabwe  ZWE  2015            3.84    Africa  1560.00  Christianity
26120     Zimbabwe  ZWE  2016            3.76    Africa  1534.00  Christianity
26121     Zimbabwe  ZWE  2017            3.68    Africa  1582.37  Christianity
26122     Zimbabwe  ZWE  2018            3.61    Africa  1611.41  Christianity
26123     Zimbabwe  ZWE  2019            3.53    Africa      NaN  Christianity

[26124 rows x 7 columns]

In [131]:
resultSet = pd.merge(resultSet, countriesSexRatio,"left",left_on=["Code", "Year"], right_on=["Code", "Year"] )
resultSet

            Entity Code  Year  ...      GDP      Religion   Sex_Ratio
0      Afghanistan  AFG  1950  ...  1156.00         Islam  105.188944
1      Afghanistan  AFG  1951  ...  1170.00         Islam  105.193156
2      Afghanistan  AFG  1952  ...  1189.00         Islam  105.184021
3      Afghanistan  AFG  1953  ...  1240.00         Islam  105.181066
4      Afghanistan  AFG  1954  ...  1245.00         Islam  105.192903
...            ...  ...   ...  ...      ...           ...         ...
26119     Zimbabwe  ZWE  2015  ...  1560.00  Christianity  102.232564
26120     Zimbabwe  ZWE  2016  ...  1534.00  Christianity  102.284384
26121     Zimbabwe  ZWE  2017  ...  1582.37  Christianity  102.333534
26122     Zimbabwe  ZWE  2018  ...  1611.41  Christianity         NaN
26123     Zimbabwe  ZWE  2019  ...      NaN  Christianity         NaN

[26124 rows x 8 columns]

## Cleanup

In [139]:
resultSet.drop_duplicates()
resultSet.drop(resultSet[resultSet.Entity == 'World'].index, inplace=True)
resultSet.drop(resultSet[resultSet.Entity == 'OWID_CIS'].index, inplace=True)
resultSet

            Entity Code  Year  ...      GDP      Religion   Sex_Ratio
0      Afghanistan  AFG  1950  ...  1156.00         Islam  105.188944
1      Afghanistan  AFG  1951  ...  1170.00         Islam  105.193156
2      Afghanistan  AFG  1952  ...  1189.00         Islam  105.184021
3      Afghanistan  AFG  1953  ...  1240.00         Islam  105.181066
4      Afghanistan  AFG  1954  ...  1245.00         Islam  105.192903
...            ...  ...   ...  ...      ...           ...         ...
26119     Zimbabwe  ZWE  2015  ...  1560.00  Christianity  102.232564
26120     Zimbabwe  ZWE  2016  ...  1534.00  Christianity  102.284384
26121     Zimbabwe  ZWE  2017  ...  1582.37  Christianity  102.333534
26122     Zimbabwe  ZWE  2018  ...  1611.41  Christianity         NaN
26123     Zimbabwe  ZWE  2019  ...      NaN  Christianity         NaN

[25904 rows x 8 columns]

#Export

In [133]:
resultSet.to_csv("cpw_original.csv", index=False)

# Other Shit

In [134]:
childsPerWomanOriginal.get(['Year', 'Entity', 'rate'])

In [135]:
childsPerWomanOriginal['Year'].min()

1541

In [136]:
def getYearRangeOfDataSet(childsPerWomanDataset):
  minYear = childsPerWomanOriginal['Year'].min();
  maxYear = childsPerWomanOriginal['Year'].max();
  return np.array(range(minYear, maxYear))

def getNormalized(childsPerWomanDataset):
  rangeOfDS = getYearRangeOfDataSet(childsPerWomanDataset)
  groupedCountries = childsPerWomanOriginal.groupby('Entity')

  for country in groupedCountries:
 #   for year in rangeOfDS:
      valueOfYearSelection =country[1]['Year']==2015
      valueOfYear = country[1][valueOfYearSelection]
      print(valueOfYear)

  return ""

In [137]:
getNormalized(childsPerWomanOriginal)

         Entity Code  Year  Fertility_Rate
65  Afghanistan  AFG  2015             4.8
      Entity Code  Year  Fertility_Rate
153  Albania  ALB  2015            1.71
      Entity Code  Year  Fertility_Rate
223  Algeria  DZA  2015            2.84
     Entity Code  Year  Fertility_Rate
293  Angola  AGO  2015            5.77
                  Entity Code  Year  Fertility_Rate
363  Antigua and Barbuda  ATG  2015            2.06
        Entity Code  Year  Fertility_Rate
514  Argentina  ARG  2015            2.31
      Entity Code  Year  Fertility_Rate
639  Armenia  ARM  2015            1.66
    Entity Code  Year  Fertility_Rate
709  Aruba  ABW  2015            1.76
        Entity Code  Year  Fertility_Rate
879  Australia  AUS  2015            1.86
       Entity Code  Year  Fertility_Rate
1099  Austria  AUT  2015            1.49
          Entity Code  Year  Fertility_Rate
1169  Azerbaijan  AZE  2015            2.09
       Entity Code  Year  Fertility_Rate
1239  Bahamas  BHS  2015            1.78
       Entity Code  Year  Fertility_Rate
1309  Bahrain  BHR  2015            2.05
          Entity Code  Year  Fertility_Rate
1379  Bangladesh  BGD  2015            2.13
        Entity Code  Year  Fertility_Rate
1599  Barbados  BRB  2015             1.8
       Entity Code  Year  Fertility_Rate
1722  Belarus  BLR  2015            1.69
       Entity Code  Year  Fertility_Rate
1912  Belgium  BEL  2015            1.79
      Entity Code  Year  Fertility_Rate
1982  Belize  BLZ  2015            2.54
     Entity Code  Year  Fertility_Rate
2052  Benin  BEN  2015            5.05
      Entity Code  Year  Fertility_Rate
2122  Bhutan  BTN  2015            2.09
       Entity Code  Year  Fertility_Rate
2242  Bolivia  BOL  2015            2.92
                      Entity Code  Year  Fertility_Rate
2312  Bosnia and Herzegovina  BIH  2015            1.35
        Entity Code  Year  Fertility_Rate
2382  Botswana  BWA  2015            2.77
      Entity Code  Year  Fertility_Rate
2521  Brazil  BRA  2015            1.74
      Entity Code  Year  Fertility_Rate
2591  Brunei  BRN  2015            1.88
        Entity Code  Year  Fertility_Rate
2730  Bulgaria  BGR  2015            1.55
            Entity Code  Year  Fertility_Rate
2800  Burkina Faso  BFA  2015            5.44
       Entity Code  Year  Fertility_Rate
2870  Burundi  BDI  2015            5.78
        Entity Code  Year  Fertility_Rate
2940  Cambodia  KHM  2015            2.59
        Entity Code  Year  Fertility_Rate
3010  Cameroon  CMR  2015            4.78
      Entity Code  Year  Fertility_Rate
3169  Canada  CAN  2015            1.59
          Entity Code  Year  Fertility_Rate
3239  Cape Verde  CPV  2015            2.37
                        Entity Code  Year  Fertility_Rate
3309  Central African Republic  CAF  2015            4.94
     Entity Code  Year  Fertility_Rate
3379   Chad  TCD  2015            6.05
               Entity      Code  Year  Fertility_Rate
3449  Channel Islands  OWID_CIS  2015            1.47
     Entity Code  Year  Fertility_Rate
3617  Chile  CHL  2015            1.79
     Entity Code  Year  Fertility_Rate
3837  China  CHN  2015            1.62
        Entity Code  Year  Fertility_Rate
3957  Colombia  COL  2015            1.87
       Entity Code  Year  Fertility_Rate
4027  Comoros  COM  2015            4.45
     Entity Code  Year  Fertility_Rate
4097  Congo  COG  2015            4.72
          Entity Code  Year  Fertility_Rate
4225  Costa Rica  CRI  2015             1.8
             Entity Code  Year  Fertility_Rate
4295  Cote d'Ivoire  CIV  2015            4.97
       Entity Code  Year  Fertility_Rate
4434  Croatia  HRV  2015            1.47
     Entity Code  Year  Fertility_Rate
4555   Cuba  CUB  2015            1.72
      Entity Code  Year  Fertility_Rate
4674  Cyprus  CYP  2015            1.35
       Entity Code  Year  Fertility_Rate
4894  Czechia  CZE  2015            1.52
                            Entity Code  Year  Fertility_Rate
4964  Democratic Republic of Congo  COD  2015            6.17
       Entity Code  Year  Fertility_Rate
5184  Denmark  DNK  2015            1.79
        Entity Code  Year  Fertility_Rate
5254  Djibouti  DJI  2015            2.91
                  Entity Code  Year  Fertility_Rate
5339  Dominican Republic  DOM  2015            2.45
       Entity Code  Year  Fertility_Rate
5459  Ecuador  ECU  2015            2.51
     Entity Code  Year  Fertility_Rate
5567  Egypt  EGY  2015            3.31
           Entity Code  Year  Fertility_Rate
5687  El Salvador  SLV  2015             2.1
                 Entity Code  Year  Fertility_Rate
5757  Equatorial Guinea  GNQ  2015            4.78
       Entity Code  Year  Fertility_Rate
5827  Eritrea  ERI  2015            4.21
       Entity Code  Year  Fertility_Rate
6047  Estonia  EST  2015            1.62
        Entity Code  Year  Fertility_Rate
6117  Eswatini  SWZ  2015            3.14
        Entity Code  Year  Fertility_Rate
6187  Ethiopia  ETH  2015            4.32
     Entity Code  Year  Fertility_Rate
6257   Fiji  FJI  2015            2.54
       Entity Code  Year  Fertility_Rate
6501  Finland  FIN  2015             1.8
      Entity Code  Year  Fertility_Rate
6721  France  FRA  2015            1.98
             Entity Code  Year  Fertility_Rate
6791  French Guiana  GUF  2015            3.36
                Entity Code  Year  Fertility_Rate
6861  French Polynesia  PYF  2015            2.03
     Entity Code  Year  Fertility_Rate
6931  Gabon  GAB  2015            3.85
      Entity Code  Year  Fertility_Rate
7001  Gambia  GMB  2015            5.49
       Entity Code  Year  Fertility_Rate
7121  Georgia  GEO  2015             2.0
       Entity Code  Year  Fertility_Rate
7324  Germany  DEU  2015            1.45
     Entity Code  Year  Fertility_Rate
7394  Ghana  GHA  2015            4.04
      Entity Code  Year  Fertility_Rate
7614  Greece  GRC  2015            1.31
Empty DataFrame
Columns: [Entity, Code, Year, Fertility_Rate]
Index: []
       Entity Code  Year  Fertility_Rate
7833  Grenada  GRD  2015            2.13
          Entity Code  Year  Fertility_Rate
7903  Guadeloupe  GLP  2015            1.96
     Entity Code  Year  Fertility_Rate
7973   Guam  GUM  2015            2.37
         Entity Code  Year  Fertility_Rate
8086  Guatemala  GTM  2015            3.03
      Entity Code  Year  Fertility_Rate
8156  Guinea  GIN  2015            4.93
             Entity Code  Year  Fertility_Rate
8226  Guinea-Bissau  GNB  2015            4.71
      Entity Code  Year  Fertility_Rate
8355  Guyana  GUY  2015            2.53
     Entity Code  Year  Fertility_Rate
8425  Haiti  HTI  2015            2.97
        Entity Code  Year  Fertility_Rate
8533  Honduras  HND  2015            2.51
         Entity Code  Year  Fertility_Rate
8603  Hong Kong  HKG  2015            1.27
       Entity Code  Year  Fertility_Rate
8762  Hungary  HUN  2015            1.36
       Entity Code  Year  Fertility_Rate
8932  Iceland  ISL  2015            1.95
     Entity Code  Year  Fertility_Rate
9066  India  IND  2015            2.35
         Entity Code  Year  Fertility_Rate
9191  Indonesia  IDN  2015            2.39
     Entity Code  Year  Fertility_Rate
9261   Iran  IRN  2015            1.69
     Entity Code  Year  Fertility_Rate
9331   Iraq  IRQ  2015            4.43
       Entity Code  Year  Fertility_Rate
9487  Ireland  IRL  2015            1.99
      Entity Code  Year  Fertility_Rate
9582  Israel  ISR  2015             3.0
     Entity Code  Year  Fertility_Rate
9741  Italy  ITA  2015            1.46
       Entity Code  Year  Fertility_Rate
9882  Jamaica  JAM  2015            2.03
      Entity Code  Year  Fertility_Rate
10102  Japan  JPN  2015            1.44
       Entity Code  Year  Fertility_Rate
10172  Jordan  JOR  2015            3.45
           Entity Code  Year  Fertility_Rate
10297  Kazakhstan  KAZ  2015            2.66
      Entity Code  Year  Fertility_Rate
10367  Kenya  KEN  2015            3.92
         Entity Code  Year  Fertility_Rate
10437  Kiribati  KIR  2015            3.69
       Entity Code  Year  Fertility_Rate
10507  Kuwait  KWT  2015            1.99
           Entity Code  Year  Fertility_Rate
10587  Kyrgyzstan  KGZ  2015            3.05
      Entity Code  Year  Fertility_Rate
10657   Laos  LAO  2015            2.76
       Entity Code  Year  Fertility_Rate
10752  Latvia  LVA  2015            1.53
        Entity Code  Year  Fertility_Rate
10822  Lebanon  LBN  2015            1.72
        Entity Code  Year  Fertility_Rate
10892  Lesotho  LSO  2015            3.14
        Entity Code  Year  Fertility_Rate
10962  Liberia  LBR  2015            4.65
      Entity Code  Year  Fertility_Rate
11032  Libya  LBY  2015            2.31
          Entity Code  Year  Fertility_Rate
11252  Lithuania  LTU  2015            1.64
           Entity Code  Year  Fertility_Rate
11422  Luxembourg  LUX  2015            1.56
      Entity Code  Year  Fertility_Rate
11492  Macao  MAC  2015            1.28
           Entity Code  Year  Fertility_Rate
11562  Madagascar  MDG  2015            4.24
       Entity Code  Year  Fertility_Rate
11632  Malawi  MWI  2015            4.65
         Entity Code  Year  Fertility_Rate
11720  Malaysia  MYS  2015            2.06
         Entity Code  Year  Fertility_Rate
11790  Maldives  MDV  2015            2.13
      Entity Code  Year  Fertility_Rate
11860   Mali  MLI  2015            6.15
      Entity Code  Year  Fertility_Rate
11979  Malta  MLT  2015            1.44
           Entity Code  Year  Fertility_Rate
12049  Martinique  MTQ  2015            1.91
           Entity Code  Year  Fertility_Rate
12119  Mauritania  MRT  2015            4.74
          Entity Code  Year  Fertility_Rate
12264  Mauritius  MUS  2015            1.44
        Entity Code  Year  Fertility_Rate
12334  Mayotte  MYT  2015             3.9
       Entity Code  Year  Fertility_Rate
12454  Mexico  MEX  2015            2.22
           Entity Code  Year  Fertility_Rate
12524  Micronesia  NaN  2015            3.19
        Entity Code  Year  Fertility_Rate
12594  Moldova  MDA  2015            1.25
         Entity Code  Year  Fertility_Rate
12664  Mongolia  MNG  2015            2.79
           Entity Code  Year  Fertility_Rate
12734  Montenegro  MNE  2015            1.68
        Entity Code  Year  Fertility_Rate
12804  Morocco  MAR  2015            2.53
           Entity Code  Year  Fertility_Rate
12874  Mozambique  MOZ  2015            5.31
        Entity Code  Year  Fertility_Rate
12944  Myanmar  MMR  2015            2.23
        Entity Code  Year  Fertility_Rate
13014  Namibia  NAM  2015            3.47
      Entity Code  Year  Fertility_Rate
13084  Nepal  NPL  2015            2.16
            Entity Code  Year  Fertility_Rate
13264  Netherlands  NLD  2015            1.75
                     Entity Code  Year  Fertility_Rate
13334  Netherlands Antilles  ANT  2015            1.87
              Entity Code  Year  Fertility_Rate
13404  New Caledonia  NCL  2015            2.19
            Entity Code  Year  Fertility_Rate
13569  New Zealand  NZL  2015            2.01
          Entity Code  Year  Fertility_Rate
13689  Nicaragua  NIC  2015            2.23
      Entity Code  Year  Fertility_Rate
13759  Niger  NER  2015            7.29
        Entity Code  Year  Fertility_Rate
13829  Nigeria  NGA  2015            5.59
            Entity Code  Year  Fertility_Rate
13931  North Korea  PRK  2015            1.92
                Entity Code  Year  Fertility_Rate
14001  North Macedonia  MKD  2015            1.52
       Entity Code  Year  Fertility_Rate
14221  Norway  NOR  2015            1.84
      Entity Code  Year  Fertility_Rate
14291   Oman  OMN  2015            2.74
         Entity Code  Year  Fertility_Rate
14361  Pakistan  PAK  2015            3.55
       Entity Code  Year  Fertility_Rate
14479  Panama  PAN  2015            2.54
                 Entity Code  Year  Fertility_Rate
14549  Papua New Guinea  PNG  2015            3.71
         Entity Code  Year  Fertility_Rate
14619  Paraguay  PRY  2015            2.51
      Entity Code  Year  Fertility_Rate
14739   Peru  PER  2015            2.43
            Entity Code  Year  Fertility_Rate
14952  Philippines  PHL  2015            2.96
       Entity Code  Year  Fertility_Rate
15172  Poland  POL  2015            1.31
         Entity Code  Year  Fertility_Rate
15306  Portugal  PRT  2015            1.25
            Entity Code  Year  Fertility_Rate
15416  Puerto Rico  PRI  2015            1.48
      Entity Code  Year  Fertility_Rate
15486  Qatar  QAT  2015            1.93
        Entity Code  Year  Fertility_Rate
15556  Reunion  REU  2015            2.35
        Entity Code  Year  Fertility_Rate
15717  Romania  ROU  2015            1.51
       Entity Code  Year  Fertility_Rate
15894  Russia  RUS  2015            1.74
       Entity Code  Year  Fertility_Rate
15964  Rwanda  RWA  2015            3.97
            Entity Code  Year  Fertility_Rate
16034  Saint Lucia  LCA  2015            1.47
                                 Entity Code  Year  Fertility_Rate
16104  Saint Vincent and the Grenadines  VCT  2015            1.95
      Entity Code  Year  Fertility_Rate
16174  Samoa  WSM  2015            4.03
                      Entity Code  Year  Fertility_Rate
16244  Sao Tome and Principe  STP  2015            4.52
             Entity Code  Year  Fertility_Rate
16314  Saudi Arabia  SAU  2015            2.58
        Entity Code  Year  Fertility_Rate
16384  Senegal  SEN  2015            4.84
       Entity Code  Year  Fertility_Rate
16542  Serbia  SRB  2015             1.6
           Entity Code  Year  Fertility_Rate
16612  Seychelles  SYC  2015            2.33
             Entity Code  Year  Fertility_Rate
16682  Sierra Leone  SLE  2015            4.56
          Entity Code  Year  Fertility_Rate
16819  Singapore  SGP  2015            1.24
                Entity Code  Year  Fertility_Rate
16967  Slovak Republic  NaN  2015            1.43
         Entity Code  Year  Fertility_Rate
17130  Slovenia  SVN  2015            1.61
                Entity Code  Year  Fertility_Rate
17200  Solomon Islands  SLB  2015            3.91
        Entity Code  Year  Fertility_Rate
17270  Somalia  SOM  2015            6.37
             Entity Code  Year  Fertility_Rate
17340  South Africa  ZAF  2015            2.49
            Entity Code  Year  Fertility_Rate
17442  South Korea  KOR  2015            1.28
            Entity Code  Year  Fertility_Rate
17512  South Sudan  SSD  2015            4.94
      Entity Code  Year  Fertility_Rate
17674  Spain  ESP  2015            1.35
          Entity Code  Year  Fertility_Rate
17813  Sri Lanka  LKA  2015            2.06
      Entity Code  Year  Fertility_Rate
17883  Sudan  SDN  2015             4.6
         Entity Code  Year  Fertility_Rate
17953  Suriname  SUR  2015             2.4
       Entity Code  Year  Fertility_Rate
18343  Sweden  SWE  2015            1.91
            Entity Code  Year  Fertility_Rate
18511  Switzerland  CHE  2015            1.54
      Entity Code  Year  Fertility_Rate
18581  Syria  SYR  2015            2.97
       Entity Code  Year  Fertility_Rate
18695  Taiwan  TWN  2015            1.17
           Entity Code  Year  Fertility_Rate
18765  Tajikistan  TJK  2015             3.4
         Entity Code  Year  Fertility_Rate
18835  Tanzania  TZA  2015            5.08
         Entity Code  Year  Fertility_Rate
18905  Thailand  THA  2015             1.5
            Entity Code  Year  Fertility_Rate
18975  Timor-Leste  NaN  2015            5.62
      Entity Code  Year  Fertility_Rate
19045   Togo  TGO  2015            4.52
      Entity Code  Year  Fertility_Rate
19115  Tonga  TON  2015            3.68
                    Entity Code  Year  Fertility_Rate
19321  Trinidad and Tobago  TTO  2015            1.77
        Entity Code  Year  Fertility_Rate
19395  Tunisia  TUN  2015            2.22
       Entity Code  Year  Fertility_Rate
19477  Turkey  TUR  2015            2.07
             Entity Code  Year  Fertility_Rate
19547  Turkmenistan  TKM  2015            2.93
       Entity Code  Year  Fertility_Rate
19617  Uganda  UGA  2015            5.68
        Entity Code  Year  Fertility_Rate
19740  Ukraine  UKR  2015            1.53
                     Entity Code  Year  Fertility_Rate
19810  United Arab Emirates  ARE  2015            1.77
               Entity Code  Year  Fertility_Rate
20289  United Kingdom  GBR  2015            1.88
              Entity Code  Year  Fertility_Rate
20489  United States  USA  2015            1.93
                             Entity Code  Year  Fertility_Rate
20559  United States Virgin Islands  VIR  2015            2.24
        Entity Code  Year  Fertility_Rate
20697  Uruguay  URY  2015            2.01
           Entity Code  Year  Fertility_Rate
20767  Uzbekistan  UZB  2015            2.31
        Entity Code  Year  Fertility_Rate
20837  Vanuatu  VUT  2015            3.31
          Entity Code  Year  Fertility_Rate
20970  Venezuela  VEN  2015            2.34
        Entity Code  Year  Fertility_Rate
21077  Vietnam  VNM  2015            1.96
               Entity Code  Year  Fertility_Rate
21147  Western Sahara  ESH  2015            2.52
      Entity      Code  Year  Fertility_Rate
21367  World  OWID_WRL  2015            2.49
      Entity Code  Year  Fertility_Rate
21437  Yemen  YEM  2015             4.1
       Entity Code  Year  Fertility_Rate
21507  Zambia  ZMB  2015            5.04
         Entity Code  Year  Fertility_Rate
21577  Zimbabwe  ZWE  2015            3.84

''

In [138]:
groupedCountries = childsPerWomanOriginal.groupby('Entity')
groupedCountries.nth(100)

                   Code  Year  Fertility_Rate
Entity
Argentina           ARG  1969            3.06
Armenia             ARM  1995            1.80
Australia           AUS  1950            3.07
Austria             AUT  1900            4.33
Barbados            BRB  1900            5.06
...                 ...   ...             ...
United States       USA  1920            3.26
Uruguay             URY  1982            2.62
Venezuela           VEN  1987            3.67
Vietnam             VNM  2013            1.96
World          OWID_WRL  1900            5.52

[78 rows x 3 columns]

from google.colab import drive
drive.mount('/content/drive')